
import { createSlice } from "@reduxjs/toolkit";
const pizzaPrices = {
    "Пепперони Фреш": {
        "тонкое": {
            "26": 40,
            "30": 70,
            "40": 100
        },
        "традиционное": {
            "26": 45,
            "30": 75,
            "40": 105
        }
    },
    "Крэйзи пепперони": {
        "тонкое": {
            '26': 40,
            '30': 70,
            '40': 100
        },
        "традиционное": {
            '26': 45,
            '30': 75,
            '40': 105
        }
    },
    "Цыпленок барбекю": {
        "тонкое": {
            '26': 40,
            '30': 70,
            '40': 100
        },
        "традиционное": {
            '26': 45,
            '30': 75,
            '40': 105
        }
    },
    "Кисло-сладкий цыпленок": {
        "тонкое": {
            '26': 40,
            '30': 70,
            '40': 100
        },
        "традиционное": {
            '26': 45,
            '30': 75,
            '40': 105
        }
    },
    "Сырная": {
        "тонкое": {
            '26': 40,
            '30': 70,
            '40': 100
        },
        "традиционное": {
            '26': 45,
            '30': 75,
            '40': 105
        }
    },
    "Овощи и грибы 🌱": {
        "тонкое": {
            '26': 40,
            '30': 70,
            '40': 100
        },
        "традиционное": {
            '26': 45,
            '30': 75,
            '40': 105
        }
    },
    "Чизбургер-пицца": {
        "тонкое": {
            '26': 40,
            '30': 70,
            '40': 100
        },
        "традиционное": {
            '26': 45,
            '30': 75,
            '40': 105
        }
    },
    "Пепперони": {
        "тонкое": {
            '26': 40,
            '30': 70,
            '40': 100
        },
        "традиционное": {
            '26': 45,
            '30': 75,
            '40': 105
        }
    },
    "Маргарита": {
        "тонкое": {
            '26': 40,
            '30': 70,
            '40': 100
        },
        "традиционное": {
            '26': 45,
            '30': 75,
            '40': 105
        }
    },
    "Четыре сезона": {
        "тонкое": {
            '26': 40,
            '30': 70,
            '40': 100
        },
        "традиционное": {
            '26': 45,
            '30': 75,
            '40': 105
        }
    }
}
const pizzasPrices = createSlice({
    name: 'pizzasPrices',
    initialState: {
        pizzaPrices,
    },
})
export default pizzasPrices.reducer